numbers = [-214, 181, -139, 448, -20, -917, 32,
           422, -895, 198, 284, 472, -986, -964, -989, 29]
# Скопируйте все содержимое списка numbers в новую переменную copy_numbers
copy_numbers = numbers[:]
# Выведите список copy_numbers
print(copy_numbers)
