numbers = [-214, 181, -139, 448, -20, -917, 32,
           422, -895, 198, 284, 472, -986, -964, -989, 29]
# Добавьте значение 111 на 5-й индекс
numbers.insert(5, 111)
# Добавьте значение 222 на 8-й индекс
numbers.insert(8, 222)
# Добавьте значение 789 на 0-й индекс
numbers.insert(0, 789)
# Добавьте значение 201 на 11-й индекс
numbers.insert(11, 201)
# Выведите измененный список
print(numbers)
