numbers = [-214, 181, -139, 448, -20, -917, 32,
           422, -895, 198, 284, 472, -986, -964, -989, 29]
# Отсортируйте список в порядке убывания
numbers.sort(reverse=True)
# Выведите отсортированный список
print(numbers)
