numbers = [-214, 181, -139, 448, -20, -917, 32,
           422, -895, 198, 284, 472, -986, -964, -989, 29]
# Добавьте четыре элемента в конец списка
numbers.extend([111, 222, 789, 201])
# Выведите измененный список
print(numbers)
